# ⠀⠀⠀⠀⠀⠀⠀⠀⠀⣤⢦⡤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
# ⠀⠀⠀⠀⠀⠀⠀⢀⡾⠁⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
# ⠀⠀⠀⠀⠀⠀⠀⢸⡀⠈⣇⢀⣀⣀⣀⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
# ⠀⠀⠀⠀⠀⠀⠀⢘⣷⣄⣙⡏⠁⠀⠀⢬⣉⠙⠶⣄⣀⣀⣀⣠⣤⣤⡄⠀⠀⠀
# ⠀⠀⠀⠀⠀⢀⣼⠿⠟⠉⠉⠀⠀⠀⠀⠀⠉⠙⠛⢿⠉⠉⠁⠀⠀⢸⡇⠀⠀⠀
# ⠀⠀⠀⣀⣶⡿⠁⠀⠀⠀⠀⡄⠀⢰⣆⠀⠀⠀⠀⠘⣇⠀⠀⠀⢀⣸⡇⠀⠀⠀
# ⢴⠞⠛⠉⢹⡄⢰⡆⠀⠀⢸⢿⡆⠸⡟⣧⠀⠀⠀⠀⢹⡤⠶⠛⠛⣿⡅⠀⠀⠀
# ⠸⣇⠀⠀⠸⡇⢸⠀⠀⣶⣿⠤⠿⣆⣿⠙⣳⣄⠀⠀⠈⣧⠀⠀⣺⣽⠇⠀⠀⠀
# ⠀⠙⣶⣶⠿⡇⣾⡇⠀⣿⣿⣶⡄⠙⢿⡄⠏⠻⣷⣄⠀⢻⡶⢿⣿⠿⠂⠀⠀⠀
# ⠀⠀⠹⡆⠀⣿⠋⢷⡀⣿⡟⠇⠉⠀⠀⠁⠀⠀⢻⡼⣿⠿⠷⣾⣅⡀⠀⠀⠀⠀
# ⠀⠀⠀⠹⣾⣷⡶⠾⢷⣸⣷⡀⠀⠀⣆⣤⣴⣤⣾⡿⣏⣀⠀⢻⡿⠁⠀⠀⠀⠀
# ⠀⠀⠀⠀⠀⢹⣧⣄⣤⠿⣿⣿⣿⢶⣶⣾⣯⣿⢿⠁⣸⠏⠙⠛⠶⣄⡀⠀⠀⠀
# ⠀⠀⠀⠀⠀⠀⢠⣾⣿⠷⠈⢁⣿⣄⣻⣿⣹⣿⣼⣸⣧⠀⠀⠀⠀⢈⣷⠀⠀⠀
# ⠀⠀⠀⠀⣠⣶⠟⠋⠈⢳⣤⣾⡥⢽⡏⣿⠉⣸⡿⢯⣿⢷⣼⠃⠀⢸⡇⠀⠀⠀
# ⠀⠀⠀⠀⠻⣏⠀⠀⠀⣾⠁⢻⡟⠋⣿⣿⠀⣿⣀⣤⣿⣼⠛⠇⢀⡿⠀⠀⠀⠀
# ⠀⠀⠀⠀⠀⠘⣇⠀⠀⠈⢷⣿⠟⠛⣻⡟⢀⡟⠄⢀⣿⡇⠀⠀⢸⡇⠀⠀⠀⠀
# ⠀⠀⠀⠀⠀⢀⣸⣧⠀⠀⠀⣿⠆⢰⣿⢢⣼⠃⠀⣾⢿⡀⠀⠀⣼⣿⣷⢲⣦⡄
# ⠀⠀⠀⠐⣏⢻⣭⣿⡇⠀⣀⡿⠀⢸⣧⡾⣿⡀⠀⢡⣾⠻⢿⣴⣿⣿⣣⣾⠿⠀
# ⠀⠀⠀⠀⠹⣄⠻⠿⣣⣴⠿⠶⠶⡿⠉⣇⠈⢳⣤⠿⣿⣶⡟⠹⣿⠛⠋⠀⠀⠀
# ⠀⠀⠀⠀⠀⠹⢷⣾⣿⡟⠛⠶⢼⣇⣀⣿⣠⡴⢿⡖⠛⢯⣙⡾⠉⠀⠀⠀⠀⠀
# ⠀⠀⠀⠀⠀⠀⠈⣿⣿⠷⠶⢤⣼⣇⣠⣽⣇⣠⣤⣷⡴⠞⢿⡄⠀⠀⠀⠀⠀⠀
# ⠀⠀⠀⠀⠀⠀⠀⣿⡆⠀⠀⠀⠉⠙⣷⠈⢷⣀⣤⠾⣶⣶⣾⣿⡄⠀⠀⠀⠀⠀
# ⠀⠀⠀⠀⠀⠀⠀⠘⣿⡤⡴⠒⣛⣛⣿⣄⣈⣻⡾⢋⠉⠀⠀⢹⣿⠀⠀⠀⠀⠀

def converter_words(text, from_layout, to_layout):
    result = ""
    for ch in text:
        index = from_layout.find(ch)
        if index != -1:
            result = result + to_layout[index]
        else:
            result = result + ch
    return result

eng_layout = "qwertyuiop[]asdfghjkl;'zxcvbnm,./QWERTYUIOP[]ASDFGHJKL;'ZXCVBNM,./";
rus_layout = "йцукенгшщзхъфывапролджэячсмитьбю.ЙЦУКЕНГШЩЗХЪФЫВАПРОЛДЖЭЯЧСМИТЬБЮ.";

input_text = input("Введите текст: ")
print("Ввыберите язык результата")
print("1 - Русский (перевод с английского)")
print("2 - Английский (перевод с английского)")

myChoose = input()
if myChoose == "1":
    print("Вы выбрали русский")
    otvet = converter_words(input_text,eng_layout,rus_layout)
elif myChoose == "2":
    print("Вы выбрали английский")
    otvet = converter_words(input_text,rus_layout,eng_layout)
else:
    print("Неверный выбор")

print("Ввыберите результат - заглавными или строчными")
print("1 - Заглавный")
print("2 - Строчный")
otvet2 = input("Введите цифру: ")

if otvet2 == "1":
     print("РЕЗУЛЬТАТ : ",otvet.upper())
elif otvet2 == "2":
    print("РЕЗУЛЬТАТ : ", otvet.lower())
else:
    print("Неверный выбор")